turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8H.atdf
        <module name="CAN" version="6019N">
          <instance name="CAN0">
            <register-group address-space="base" name="CAN0" name-in-module="CAN" offset="0x400B4000"/>
            <signals>
              <signal pad="PA1" function="A" group="CANRX" index="0"/>
              <signal pad="PA0" function="A" group="CANTX" index="0"/>
            </signals>
          </instance>
          <instance name="CAN1">
            <register-group address-space="base" name="CAN1" name-in-module="CAN" offset="0x400B8000"/>
            <signals>
              <signal pad="PB15" function="A" group="CANRX" index="1"/>
              <signal pad="PB14" function="A" group="CANTX" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" version="6417R">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0940"/>
          </instance>
        </module>
        <module name="DACC" version="6461F">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x400C8000"/>
            <signals>
              <signal pad="PB15" function="X1" group="DAC" index="0"/>
              <signal pad="PB15" function="X1" group="WKUP" index="12"/>
              <signal pad="PB16" function="X1" group="DAC" index="1"/>
              <signal pad="PA10" function="B" group="DATRG"/>
            </signals>
          </instance>
        </module>
        <module name="DMAC" version="6233P">
          <instance name="DMAC">
            <register-group address-space="base" name="DMAC" name-in-module="DMAC" offset="0x400C4000"/>
          </instance>
        </module>
        <module name="EFC" version="6450J">
          <instance name="EFC0">
            <register-group address-space="base" name="EFC0" name-in-module="EFC" offset="0x400E0A00"/>
            <parameters>
              <param name="FLASH_SIZE" value="262144"/>
              <param name="PAGE_SIZE" value="256"/>
              <param name="PAGES_PR_REGION" value="64"/>
            </parameters>
          </instance>
          <instance name="EFC1">
            <register-group address-space="base" name="EFC1" name-in-module="EFC" offset="0x400E0C00"/>
            <parameters>
              <param name="FLASH_SIZE" value="262144"/>
              <param name="PAGE_SIZE" value="256"/>
              <param name="PAGES_PR_REGION" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="EMAC" version="6119I">
          <instance name="EMAC">
            <register-group address-space="base" name="EMAC" name-in-module="EMAC" offset="0x400B0000"/>
            <signals>
              <signal pad="PC13" function="B" group="ECOL"/>
              <signal pad="PC10" function="B" group="ECRS"/>
              <signal pad="PB4" function="A" group="ECRSDV"/>
              <signal pad="PB4" function="A" group="ERXDV"/>
              <signal pad="PB8" function="A" group="EMDC"/>
              <signal pad="PB9" function="A" group="EMDIO"/>
              <signal pad="PC14" function="B" group="ERXCK"/>
              <signal pad="PB7" function="A" group="ERXER"/>
              <signal pad="PB5" function="A" group="ERX" index="0"/>
              <signal pad="PB6" function="A" group="ERX" index="1"/>
              <signal pad="PC11" function="B" group="ERX" index="2"/>
              <signal pad="PC12" function="B" group="ERX" index="3"/>
              <signal pad="PB0" function="A" group="ETXCK"/>
              <signal pad="PB1" function="A" group="ETXEN"/>
              <signal pad="PC17" function="B" group="ETXER"/>
              <signal pad="PB2" function="A" group="ETX" index="0"/>
              <signal pad="PB3" function="A" group="ETX" index="1"/>
              <signal pad="PC15" function="B" group="ETX" index="2"/>
              <signal pad="PC16" function="B" group="ETX" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="GPBR" version="6378D">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1A90"/>
          </instance>
        </module>
        <module name="HSMCI" version="6449O">
          <instance name="HSMCI">
            <register-group address-space="base" name="HSMCI" name-in-module="HSMCI" offset="0x40000000"/>
            <signals>
              <signal pad="PA20" function="A" group="MCCDA"/>
              <signal pad="PE20" function="B" group="MCCDB"/>
              <signal pad="PA19" function="A" group="MCCK"/>
              <signal pad="PA21" function="A" group="MCDA" index="0"/>
              <signal pad="PA22" function="A" group="MCDA" index="1"/>
              <signal pad="PA23" function="A" group="MCDA" index="2"/>
              <signal pad="PA24" function="A" group="MCDA" index="3"/>
              <signal pad="PD0" function="B" group="MCDA" index="4"/>
              <signal pad="PD1" function="B" group="MCDA" index="5"/>
              <signal pad="PD2" function="B" group="MCDA" index="6"/>
              <signal pad="PD3" function="B" group="MCDA" index="7"/>
              <signal pad="PE22" function="B" group="MCDB" index="0"/>
              <signal pad="PE24" function="B" group="MCDB" index="1"/>
              <signal pad="PE26" function="B" group="MCDB" index="2"/>
              <signal pad="PE27" function="B" group="MCDB" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="MATRIX" version="11060A">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0400"/>
          </instance>
        </module>
        <module name="PIO" version="6315C">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
