turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8H.atdf
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
          </instance>
          <instance name="PIOC">
            <register-group address-space="base" name="PIOC" name-in-module="PIO" offset="0x400E1200"/>
          </instance>
          <instance name="PIOD">
            <register-group address-space="base" name="PIOD" name-in-module="PIO" offset="0x400E1400"/>
          </instance>
          <instance name="PIOE">
            <register-group address-space="base" name="PIOE" name-in-module="PIO" offset="0x400E1600"/>
          </instance>
          <instance name="PIOF">
            <register-group address-space="base" name="PIOF" name-in-module="PIO" offset="0x400E1800"/>
          </instance>
        </module>
        <module name="PMC" version="11116I">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0600"/>
            <signals>
              <signal pad="PA1" function="B" group="PCK" index="0"/>
              <signal pad="PB22" function="B" group="PCK" index="0"/>
              <signal pad="PA24" function="B" group="PCK" index="1"/>
              <signal pad="PA30" function="B" group="PCK" index="1"/>
              <signal pad="PA28" function="B" group="PCK" index="2"/>
              <signal pad="PA31" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" version="6343J">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x40094000"/>
            <signals>
              <signal pad="PA5" function="B" group="PWMFI" index="0"/>
              <signal pad="PA3" function="B" group="PWMFI" index="1"/>
              <signal pad="PD6" function="B" group="PWMFI" index="2"/>
              <signal pad="PA8" function="B" group="PWMH" index="0"/>
              <signal pad="PB12" function="B" group="PWMH" index="0"/>
              <signal pad="PC3" function="B" group="PWMH" index="0"/>
              <signal pad="PE15" function="A" group="PWMH" index="0"/>
              <signal pad="PA19" function="B" group="PWMH" index="1"/>
              <signal pad="PB13" function="B" group="PWMH" index="1"/>
              <signal pad="PC5" function="B" group="PWMH" index="1"/>
              <signal pad="PE16" function="A" group="PWMH" index="1"/>
              <signal pad="PA13" function="B" group="PWMH" index="2"/>
              <signal pad="PB14" function="B" group="PWMH" index="2"/>
              <signal pad="PC7" function="B" group="PWMH" index="2"/>
              <signal pad="PA9" function="B" group="PWMH" index="3"/>
              <signal pad="PB15" function="B" group="PWMH" index="3"/>
              <signal pad="PC9" function="B" group="PWMH" index="3"/>
              <signal pad="PF3" function="A" group="PWMH" index="3"/>
              <signal pad="PC20" function="B" group="PWMH" index="4"/>
              <signal pad="PE20" function="A" group="PWMH" index="4"/>
              <signal pad="PC19" function="B" group="PWMH" index="5"/>
              <signal pad="PE22" function="A" group="PWMH" index="5"/>
              <signal pad="PC18" function="B" group="PWMH" index="6"/>
              <signal pad="PE24" function="A" group="PWMH" index="6"/>
              <signal pad="PE26" function="A" group="PWMH" index="7"/>
              <signal pad="PA21" function="B" group="PWML" index="0"/>
              <signal pad="PB16" function="B" group="PWML" index="0"/>
              <signal pad="PC2" function="B" group="PWML" index="0"/>
              <signal pad="PE18" function="A" group="PWML" index="0"/>
              <signal pad="PA12" function="B" group="PWML" index="1"/>
              <signal pad="PB17" function="B" group="PWML" index="1"/>
              <signal pad="PC4" function="B" group="PWML" index="1"/>
              <signal pad="PA20" function="B" group="PWML" index="2"/>
              <signal pad="PB18" function="B" group="PWML" index="2"/>
              <signal pad="PC6" function="B" group="PWML" index="2"/>
              <signal pad="PE17" function="A" group="PWML" index="2"/>
              <signal pad="PA0" function="B" group="PWML" index="3"/>
              <signal pad="PB19" function="B" group="PWML" index="3"/>
              <signal pad="PC8" function="B" group="PWML" index="3"/>
              <signal pad="PB6" function="B" group="PWML" index="4"/>
              <signal pad="PC21" function="B" group="PWML" index="4"/>
              <signal pad="PE19" function="A" group="PWML" index="4"/>
              <signal pad="PB7" function="B" group="PWML" index="5"/>
              <signal pad="PC22" function="B" group="PWML" index="5"/>
              <signal pad="PE21" function="A" group="PWML" index="5"/>
              <signal pad="PB8" function="B" group="PWML" index="6"/>
              <signal pad="PC23" function="B" group="PWML" index="6"/>
              <signal pad="PE23" function="A" group="PWML" index="6"/>
              <signal pad="PB9" function="B" group="PWML" index="7"/>
              <signal pad="PC24" function="B" group="PWML" index="7"/>
              <signal pad="PE25" function="A" group="PWML" index="7"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" version="11009D">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1A00"/>
          </instance>
        </module>
        <module name="RTC" version="6056O">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1A60"/>
          </instance>
        </module>
        <module name="RTT" version="6081I">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1A30"/>
