turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8H.atdf
          </instance>
        </module>
        <module name="TWI" version="6212O">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0x4008C000"/>
            <signals>
              <signal pad="PA18" function="A" group="TWCK" index="0"/>
              <signal pad="PA17" function="A" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x40090000"/>
            <signals>
              <signal pad="PB13" function="A" group="TWCK" index="1"/>
              <signal pad="PB12" function="A" group="TWD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="UART" version="6418H">
          <instance name="UART">
            <register-group address-space="base" name="UART" name-in-module="UART" offset="0x400E0800"/>
            <signals>
              <signal pad="PA8" function="A" group="URXD"/>
              <signal pad="PA9" function="A" group="UTXD"/>
            </signals>
          </instance>
        </module>
        <module name="UOTGHS" version="11016C">
          <instance name="UOTGHS">
            <register-group address-space="base" name="UOTGHS" name-in-module="UOTGHS" offset="0x400AC000"/>
            <signals>
              <signal pad="PB11" function="A" group="UOTGID"/>
              <signal pad="PB10" function="A" group="UOTGVBOF"/>
            </signals>
          </instance>
        </module>
        <module name="USART" version="6089ZF">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x40098000"/>
            <signals>
              <signal pad="PB26" function="A" group="CTS" index="0"/>
              <signal pad="PB25" function="A" group="RTS" index="0"/>
              <signal pad="PA10" function="A" group="RXD" index="0"/>
              <signal pad="PA17" function="B" group="SCK" index="0"/>
              <signal pad="PA11" function="A" group="TXD" index="0"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x4009C000"/>
            <signals>
              <signal pad="PA15" function="A" group="CTS" index="1"/>
              <signal pad="PA14" function="A" group="RTS" index="1"/>
              <signal pad="PA12" function="A" group="RXD" index="1"/>
              <signal pad="PA16" function="A" group="SCK" index="1"/>
              <signal pad="PA13" function="A" group="TXD" index="1"/>
            </signals>
          </instance>
          <instance name="USART2">
            <register-group address-space="base" name="USART2" name-in-module="USART" offset="0x400A0000"/>
            <signals>
              <signal pad="PB23" function="A" group="CTS" index="2"/>
              <signal pad="PB22" function="A" group="RTS" index="2"/>
              <signal pad="PB21" function="A" group="RXD" index="2"/>
              <signal pad="PB24" function="A" group="SCK" index="2"/>
              <signal pad="PB20" function="A" group="TXD" index="2"/>
            </signals>
          </instance>
          <instance name="USART3">
            <register-group address-space="base" name="USART3" name-in-module="USART" offset="0x400A4000"/>
            <signals>
              <signal pad="PF4" function="A" group="CTS" index="3"/>
              <signal pad="PF5" function="A" group="RTS" index="3"/>
              <signal pad="PD5" function="B" group="RXD" index="3"/>
              <signal pad="PE16" function="B" group="SCK" index="3"/>
              <signal pad="PD4" function="B" group="TXD" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" version="6080F">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1A50"/>
          </instance>
        </module>
        <module name="FUSES" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
      <module name="SystemControl">
            <instance name="SystemControl">
                <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
            </instance>
        </module><module name="SysTick">
            <instance name="SysTick">
                <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
            </instance>
        </module><module name="NVIC">
            <instance name="NVIC">
                <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
            </instance>
        </module></peripherals>
      <interrupts>
        <interrupt index="-14" name="NonMaskableInt_IRQn" caption="Non Maskable Interrupt"/>
        <interrupt index="-12" name="MemoryManagement_IRQn" caption="Cortex-M3 Memory Management Interrupt"/>
        <interrupt index="-11" name="BusFault_IRQn" caption="Cortex-M3 Bus Fault Interrupt"/>
        <interrupt index="-10" name="UsageFault_IRQn" caption="Cortex-M3 Usage Fault Interrupt"/>
        <interrupt index="-5" name="SVCall_IRQn" caption="Cortex-M3 SV Call Interrupt"/>
        <interrupt index="-4" name="DebugMonitor_IRQn" caption="Cortex-M3 Debug Monitor Interrupt"/>
        <interrupt index="-2" name="PendSV_IRQn" caption="Cortex-M3 Pend SV Interrupt"/>
        <interrupt index="-1" name="SysTick_IRQn" caption="Cortex-M3 System Tick Interrupt"/>
        <interrupt index="0" module-instance="SYSC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="SYSC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="SYSC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="SYSC" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="SYSC" name="WDT" caption="Watchdog Timer"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="EFC0" name="EFC0" caption="Enhanced Flash Controller 0"/>
        <interrupt index="7" module-instance="EFC1" name="EFC1" caption="Enhanced Flash Controller 1"/>
        <interrupt index="8" module-instance="UART" name="UART" caption="Universal Asynchronous Receiver Transceiver"/>
        <interrupt index="10" module-instance="SDRAMC" name="SDRAMC" caption="Synchronous Dynamic RAM Controller"/>
        <interrupt index="11" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller A,"/>
        <interrupt index="12" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller B"/>
        <interrupt index="13" module-instance="PIOC" name="PIOC" caption="Parallel I/O Controller C"/>
        <interrupt index="14" module-instance="PIOD" name="PIOD" caption="Parallel I/O Controller D"/>
        <interrupt index="15" module-instance="PIOE" name="PIOE" caption="Parallel I/O Controller E"/>
        <interrupt index="16" module-instance="PIOF" name="PIOF" caption="Parallel I/O Controller F"/>
        <interrupt index="17" module-instance="USART0" name="USART0" caption="USART 0"/>
        <interrupt index="18" module-instance="USART1" name="USART1" caption="USART 1"/>
        <interrupt index="19" module-instance="USART2" name="USART2" caption="USART 2"/>
        <interrupt index="20" module-instance="USART3" name="USART3" caption="USART 3"/>
        <interrupt index="21" module-instance="HSMCI" name="HSMCI" caption="Multimedia Card Interface"/>
        <interrupt index="22" module-instance="TWI0" name="TWI0" caption="Two-Wire Interface 0"/>
        <interrupt index="23" module-instance="TWI1" name="TWI1" caption="Two-Wire Interface 1"/>
        <interrupt index="24" module-instance="SPI0" name="SPI0" caption="Serial Peripheral Interface"/>
        <interrupt index="25" module-instance="SPI1" name="SPI1" caption="Serial Peripheral Interface"/>
        <interrupt index="26" module-instance="SSC" name="SSC" caption="Synchronous Serial Controller"/>
        <interrupt index="27" module-instance="TC0" name="TC0" caption="Timer Counter 0"/>
        <interrupt index="28" module-instance="TC0" name="TC1" caption="Timer Counter 1"/>
        <interrupt index="29" module-instance="TC0" name="TC2" caption="Timer Counter 2"/>
        <interrupt index="30" module-instance="TC1" name="TC3" caption="Timer Counter 3"/>
        <interrupt index="31" module-instance="TC1" name="TC4" caption="Timer Counter 4"/>
        <interrupt index="32" module-instance="TC1" name="TC5" caption="Timer Counter 5"/>
        <interrupt index="33" module-instance="TC2" name="TC6" caption="Timer Counter 6"/>
        <interrupt index="34" module-instance="TC2" name="TC7" caption="Timer Counter 7"/>
        <interrupt index="35" module-instance="TC2" name="TC8" caption="Timer Counter 8"/>
        <interrupt index="36" module-instance="PWM" name="PWM" caption="Pulse Width Modulation Controller"/>
        <interrupt index="37" module-instance="ADC" name="ADC" caption="ADC Controller"/>
        <interrupt index="38" module-instance="DACC" name="DACC" caption="DAC Controller"/>
        <interrupt index="39" module-instance="DMAC" name="DMAC" caption="DMA Controller"/>
        <interrupt index="40" module-instance="UOTGHS" name="UOTGHS" caption="USB OTG High Speed"/>
        <interrupt index="41" module-instance="TRNG" name="TRNG" caption="True Random Number Generator"/>
        <interrupt index="42" module-instance="EMAC" name="EMAC" caption="Ethernet MAC"/>
        <interrupt index="43" module-instance="CAN0" name="CAN0" caption="CAN Controller 0"/>
        <interrupt index="44" module-instance="CAN1" name="CAN1" caption="CAN Controller 1"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B2B03F"/>
          <property name="CHIPID_CIDR" value="0x286E0A60"/>
          <property name="CHIPID_EXID" value="0x0"/>
        </property-group>
      </property-groups>
      <parameters>
        <param name="__CM3_REV" value="0x0200"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__FPU_PRESENT" value="0"/>
        <param name="__NVIC_PRIO_BITS" value="4"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
    </device>
  </devices>
  <modules>
    <module caption="Analog-to-Digital Converter" name="ADC" version="6489Q">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="ADC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Fast Wake Up" mask="0x00000040" name="FWUP" values="ADC_MR__FWUP"/>
          <bitfield caption="Free Run Mode" mask="0x00000080" name="FREERUN" values="ADC_MR__FREERUN"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Analog Settling Time" mask="0x00300000" name="SETTLING" values="ADC_MR__SETTLING"/>
          <bitfield caption="Analog Change" mask="0x00800000" name="ANACH" values="ADC_MR__ANACH"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Transfer Period" mask="0x30000000" name="TRANSFER"/>
          <bitfield caption="Use Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
