turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8H.atdf
      <value-group caption="" name="ADC_MR__STARTUP">
        <value caption="0 periods of ADCClock" name="SUT0" value="0x0"/>
        <value caption="8 periods of ADCClock" name="SUT8" value="0x1"/>
        <value caption="16 periods of ADCClock" name="SUT16" value="0x2"/>
        <value caption="24 periods of ADCClock" name="SUT24" value="0x3"/>
        <value caption="64 periods of ADCClock" name="SUT64" value="0x4"/>
        <value caption="80 periods of ADCClock" name="SUT80" value="0x5"/>
        <value caption="96 periods of ADCClock" name="SUT96" value="0x6"/>
        <value caption="112 periods of ADCClock" name="SUT112" value="0x7"/>
        <value caption="512 periods of ADCClock" name="SUT512" value="0x8"/>
        <value caption="576 periods of ADCClock" name="SUT576" value="0x9"/>
        <value caption="640 periods of ADCClock" name="SUT640" value="0xA"/>
        <value caption="704 periods of ADCClock" name="SUT704" value="0xB"/>
        <value caption="768 periods of ADCClock" name="SUT768" value="0xC"/>
        <value caption="832 periods of ADCClock" name="SUT832" value="0xD"/>
        <value caption="896 periods of ADCClock" name="SUT896" value="0xE"/>
        <value caption="960 periods of ADCClock" name="SUT960" value="0xF"/>
      </value-group>
      <value-group caption="" name="ADC_MR__SETTLING">
        <value caption="3 periods of ADCClock" name="AST3" value="0x0"/>
        <value caption="5 periods of ADCClock" name="AST5" value="0x1"/>
        <value caption="9 periods of ADCClock" name="AST9" value="0x2"/>
        <value caption="17 periods of ADCClock" name="AST17" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_MR__ANACH">
        <value caption="No analog change on channel switching: DIFF0, GAIN0 and OFF0 are used for all channels" name="NONE" value="0"/>
        <value caption="Allows different analog settings for each channel. See ADC_CGR and ADC_COR Registers" name="ALLOWED" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__USEQ">
        <value caption="Normal Mode: The controller converts channels in a simple numeric order depending only on the channel index." name="NUM_ORDER" value="0"/>
        <value caption="User Sequence Mode: The sequence respects what is defined in ADC_SEQR1 and ADC_SEQR2 registers and can be used to convert several times the same channel." name="REG_ORDER" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_EMR__CMPMODE">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module caption="Controller Area Network" name="CAN" version="6019N">
      <register-group name="CAN">
        <register caption="Mode Register" name="CAN_MR" offset="0x0000" rw="RW" size="4">
          <bitfield caption="CAN Controller Enable" mask="0x00000001" name="CANEN"/>
          <bitfield caption="Disable/Enable Low Power Mode" mask="0x00000002" name="LPM"/>
          <bitfield caption="Disable/Enable Autobaud/Listen mode" mask="0x00000004" name="ABM"/>
          <bitfield caption="Disable/Enable Overload Frame" mask="0x00000008" name="OVL"/>
          <bitfield caption="Timestamp messages at each end of Frame" mask="0x00000010" name="TEOF"/>
          <bitfield caption="Disable/Enable Time Triggered Mode" mask="0x00000020" name="TTM"/>
          <bitfield caption="Enable Timer Freeze" mask="0x00000040" name="TIMFRZ"/>
          <bitfield caption="Disable Repeat" mask="0x00000080" name="DRPT"/>
          <bitfield caption="Reception Synchronization Stage (not readable)" mask="0x07000000" name="RXSYNC" values="CAN_MR__RXSYNC"/>
        </register>
        <register caption="Interrupt Enable Register" name="CAN_IER" offset="0x0004" rw="W" size="4">
          <bitfield caption="Mailbox 0 Interrupt Enable" mask="0x00000001" name="MB0"/>
          <bitfield caption="Mailbox 1 Interrupt Enable" mask="0x00000002" name="MB1"/>
          <bitfield caption="Mailbox 2 Interrupt Enable" mask="0x00000004" name="MB2"/>
          <bitfield caption="Mailbox 3 Interrupt Enable" mask="0x00000008" name="MB3"/>
          <bitfield caption="Mailbox 4 Interrupt Enable" mask="0x00000010" name="MB4"/>
          <bitfield caption="Mailbox 5 Interrupt Enable" mask="0x00000020" name="MB5"/>
          <bitfield caption="Mailbox 6 Interrupt Enable" mask="0x00000040" name="MB6"/>
          <bitfield caption="Mailbox 7 Interrupt Enable" mask="0x00000080" name="MB7"/>
          <bitfield caption="Error Active Mode Interrupt Enable" mask="0x00010000" name="ERRA"/>
          <bitfield caption="Warning Limit Interrupt Enable" mask="0x00020000" name="WARN"/>
          <bitfield caption="Error Passive Mode Interrupt Enable" mask="0x00040000" name="ERRP"/>
          <bitfield caption="Bus Off Mode Interrupt Enable" mask="0x00080000" name="BOFF"/>
          <bitfield caption="Sleep Interrupt Enable" mask="0x00100000" name="SLEEP"/>
          <bitfield caption="Wakeup Interrupt Enable" mask="0x00200000" name="WAKEUP"/>
          <bitfield caption="Timer Overflow Interrupt Enable" mask="0x00400000" name="TOVF"/>
          <bitfield caption="TimeStamp Interrupt Enable" mask="0x00800000" name="TSTP"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x01000000" name="CERR"/>
          <bitfield caption="Stuffing Error Interrupt Enable" mask="0x02000000" name="SERR"/>
          <bitfield caption="Acknowledgment Error Interrupt Enable" mask="0x04000000" name="AERR"/>
          <bitfield caption="Form Error Interrupt Enable" mask="0x08000000" name="FERR"/>
          <bitfield caption="Bit Error Interrupt Enable" mask="0x10000000" name="BERR"/>
        </register>
