turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8H.atdf
        <register caption="DMAC Channel Control A Register (ch_num = 3)" name="DMAC_CTRLA3" offset="0xC0" rw="RW" size="4">
          <bitfield caption="Buffer Transfer Size" mask="0x0000FFFF" name="BTSIZE"/>
          <bitfield caption="Source Chunk Transfer Size." mask="0x00070000" name="SCSIZE" values="DMAC_CTRLA3__SCSIZE"/>
          <bitfield caption="Destination Chunk Transfer Size" mask="0x00700000" name="DCSIZE" values="DMAC_CTRLA3__DCSIZE"/>
          <bitfield caption="Transfer Width for the Source" mask="0x03000000" name="SRC_WIDTH" values="DMAC_CTRLA3__SRC_WIDTH"/>
          <bitfield caption="Transfer Width for the Destination" mask="0x30000000" name="DST_WIDTH" values="DMAC_CTRLA3__DST_WIDTH"/>
          <bitfield caption="Current Descriptor Stop Command and Transfer Completed Memory Indicator" mask="0x80000000" name="DONE"/>
        </register>
        <register caption="DMAC Channel Control B Register (ch_num = 3)" name="DMAC_CTRLB3" offset="0xC4" rw="RW" size="4">
          <bitfield caption="Source Address Descriptor" mask="0x00010000" name="SRC_DSCR" values="DMAC_CTRLB3__SRC_DSCR"/>
          <bitfield caption="Destination Address Descriptor" mask="0x00100000" name="DST_DSCR" values="DMAC_CTRLB3__DST_DSCR"/>
          <bitfield caption="Flow Control" mask="0x00600000" name="FC" values="DMAC_CTRLB3__FC"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Source" mask="0x03000000" name="SRC_INCR" values="DMAC_CTRLB3__SRC_INCR"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Destination" mask="0x30000000" name="DST_INCR" values="DMAC_CTRLB3__DST_INCR"/>
          <bitfield caption="Interrupt Enable Not" mask="0x40000000" name="IEN"/>
        </register>
        <register caption="DMAC Channel Configuration Register (ch_num = 3)" name="DMAC_CFG3" offset="0xC8" rw="RW" size="4">
          <bitfield caption="Source with Peripheral identifier" mask="0x0000000F" name="SRC_PER"/>
          <bitfield caption="Destination with Peripheral identifier" mask="0x000000F0" name="DST_PER"/>
          <bitfield caption="Software or Hardware Selection for the Source" mask="0x00000200" name="SRC_H2SEL" values="DMAC_CFG3__SRC_H2SEL"/>
          <bitfield caption="Software or Hardware Selection for the Destination" mask="0x00002000" name="DST_H2SEL" values="DMAC_CFG3__DST_H2SEL"/>
          <bitfield caption="Stop On Done" mask="0x00010000" name="SOD" values="DMAC_CFG3__SOD"/>
          <bitfield caption="Interface Lock" mask="0x00100000" name="LOCK_IF" values="DMAC_CFG3__LOCK_IF"/>
          <bitfield caption="Bus Lock" mask="0x00200000" name="LOCK_B" values="DMAC_CFG3__LOCK_B"/>
          <bitfield caption="Master Interface Arbiter Lock" mask="0x00400000" name="LOCK_IF_L" values="DMAC_CFG3__LOCK_IF_L"/>
          <bitfield caption="AHB Protection" mask="0x07000000" name="AHB_PROT"/>
          <bitfield caption="FIFO Configuration" mask="0x30000000" name="FIFOCFG" values="DMAC_CFG3__FIFOCFG"/>
        </register>
        <register caption="DMAC Channel Source Address Register (ch_num = 4)" name="DMAC_SADDR4" offset="0xDC" rw="RW" size="4">
          <bitfield caption="Channel x Source Address" mask="0xFFFFFFFF" name="SADDR"/>
        </register>
        <register caption="DMAC Channel Destination Address Register (ch_num = 4)" name="DMAC_DADDR4" offset="0xE0" rw="RW" size="4">
          <bitfield caption="Channel x Destination Address" mask="0xFFFFFFFF" name="DADDR"/>
        </register>
        <register caption="DMAC Channel Descriptor Address Register (ch_num = 4)" name="DMAC_DSCR4" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Buffer Transfer Descriptor Address" mask="0xFFFFFFFC" name="DSCR"/>
        </register>
        <register caption="DMAC Channel Control A Register (ch_num = 4)" name="DMAC_CTRLA4" offset="0xE8" rw="RW" size="4">
          <bitfield caption="Buffer Transfer Size" mask="0x0000FFFF" name="BTSIZE"/>
          <bitfield caption="Source Chunk Transfer Size." mask="0x00070000" name="SCSIZE" values="DMAC_CTRLA4__SCSIZE"/>
          <bitfield caption="Destination Chunk Transfer Size" mask="0x00700000" name="DCSIZE" values="DMAC_CTRLA4__DCSIZE"/>
          <bitfield caption="Transfer Width for the Source" mask="0x03000000" name="SRC_WIDTH" values="DMAC_CTRLA4__SRC_WIDTH"/>
          <bitfield caption="Transfer Width for the Destination" mask="0x30000000" name="DST_WIDTH" values="DMAC_CTRLA4__DST_WIDTH"/>
          <bitfield caption="Current Descriptor Stop Command and Transfer Completed Memory Indicator" mask="0x80000000" name="DONE"/>
        </register>
        <register caption="DMAC Channel Control B Register (ch_num = 4)" name="DMAC_CTRLB4" offset="0xEC" rw="RW" size="4">
          <bitfield caption="Source Address Descriptor" mask="0x00010000" name="SRC_DSCR" values="DMAC_CTRLB4__SRC_DSCR"/>
          <bitfield caption="Destination Address Descriptor" mask="0x00100000" name="DST_DSCR" values="DMAC_CTRLB4__DST_DSCR"/>
          <bitfield caption="Flow Control" mask="0x00600000" name="FC" values="DMAC_CTRLB4__FC"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Source" mask="0x03000000" name="SRC_INCR" values="DMAC_CTRLB4__SRC_INCR"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Destination" mask="0x30000000" name="DST_INCR" values="DMAC_CTRLB4__DST_INCR"/>
          <bitfield caption="Interrupt Enable Not" mask="0x40000000" name="IEN"/>
        </register>
        <register caption="DMAC Channel Configuration Register (ch_num = 4)" name="DMAC_CFG4" offset="0xF0" rw="RW" size="4">
          <bitfield caption="Source with Peripheral identifier" mask="0x0000000F" name="SRC_PER"/>
          <bitfield caption="Destination with Peripheral identifier" mask="0x000000F0" name="DST_PER"/>
          <bitfield caption="Software or Hardware Selection for the Source" mask="0x00000200" name="SRC_H2SEL" values="DMAC_CFG4__SRC_H2SEL"/>
          <bitfield caption="Software or Hardware Selection for the Destination" mask="0x00002000" name="DST_H2SEL" values="DMAC_CFG4__DST_H2SEL"/>
          <bitfield caption="Stop On Done" mask="0x00010000" name="SOD" values="DMAC_CFG4__SOD"/>
          <bitfield caption="Interface Lock" mask="0x00100000" name="LOCK_IF" values="DMAC_CFG4__LOCK_IF"/>
          <bitfield caption="Bus Lock" mask="0x00200000" name="LOCK_B" values="DMAC_CFG4__LOCK_B"/>
          <bitfield caption="Master Interface Arbiter Lock" mask="0x00400000" name="LOCK_IF_L" values="DMAC_CFG4__LOCK_IF_L"/>
          <bitfield caption="AHB Protection" mask="0x07000000" name="AHB_PROT"/>
          <bitfield caption="FIFO Configuration" mask="0x30000000" name="FIFOCFG" values="DMAC_CFG4__FIFOCFG"/>
        </register>
        <register caption="DMAC Channel Source Address Register (ch_num = 5)" name="DMAC_SADDR5" offset="0x104" rw="RW" size="4">
          <bitfield caption="Channel x Source Address" mask="0xFFFFFFFF" name="SADDR"/>
        </register>
        <register caption="DMAC Channel Destination Address Register (ch_num = 5)" name="DMAC_DADDR5" offset="0x108" rw="RW" size="4">
          <bitfield caption="Channel x Destination Address" mask="0xFFFFFFFF" name="DADDR"/>
        </register>
