turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8H.atdf
        <register caption="PWM Output Selection Set Register" name="PWM_OSS" offset="0x4C" rw="W" size="4">
          <bitfield caption="Output Selection Set for PWMH output of the channel 0" mask="0x00000001" name="OSSH0"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 1" mask="0x00000002" name="OSSH1"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 2" mask="0x00000004" name="OSSH2"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 3" mask="0x00000008" name="OSSH3"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 4" mask="0x00000010" name="OSSH4"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 5" mask="0x00000020" name="OSSH5"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 6" mask="0x00000040" name="OSSH6"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 7" mask="0x00000080" name="OSSH7"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 0" mask="0x00010000" name="OSSL0"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 1" mask="0x00020000" name="OSSL1"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 2" mask="0x00040000" name="OSSL2"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 3" mask="0x00080000" name="OSSL3"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 4" mask="0x00100000" name="OSSL4"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 5" mask="0x00200000" name="OSSL5"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 6" mask="0x00400000" name="OSSL6"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 7" mask="0x00800000" name="OSSL7"/>
        </register>
        <register caption="PWM Output Selection Clear Register" name="PWM_OSC" offset="0x50" rw="W" size="4">
          <bitfield caption="Output Selection Clear for PWMH output of the channel 0" mask="0x00000001" name="OSCH0"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 1" mask="0x00000002" name="OSCH1"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 2" mask="0x00000004" name="OSCH2"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 3" mask="0x00000008" name="OSCH3"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 4" mask="0x00000010" name="OSCH4"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 5" mask="0x00000020" name="OSCH5"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 6" mask="0x00000040" name="OSCH6"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 7" mask="0x00000080" name="OSCH7"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 0" mask="0x00010000" name="OSCL0"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 1" mask="0x00020000" name="OSCL1"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 2" mask="0x00040000" name="OSCL2"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 3" mask="0x00080000" name="OSCL3"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 4" mask="0x00100000" name="OSCL4"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 5" mask="0x00200000" name="OSCL5"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 6" mask="0x00400000" name="OSCL6"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 7" mask="0x00800000" name="OSCL7"/>
        </register>
        <register caption="PWM Output Selection Set Update Register" name="PWM_OSSUPD" offset="0x54" rw="W" size="4">
          <bitfield caption="Output Selection Set for PWMH output of the channel 0" mask="0x00000001" name="OSSUPH0"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 1" mask="0x00000002" name="OSSUPH1"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 2" mask="0x00000004" name="OSSUPH2"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 3" mask="0x00000008" name="OSSUPH3"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 4" mask="0x00000010" name="OSSUPH4"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 5" mask="0x00000020" name="OSSUPH5"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 6" mask="0x00000040" name="OSSUPH6"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 7" mask="0x00000080" name="OSSUPH7"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 0" mask="0x00010000" name="OSSUPL0"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 1" mask="0x00020000" name="OSSUPL1"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 2" mask="0x00040000" name="OSSUPL2"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 3" mask="0x00080000" name="OSSUPL3"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 4" mask="0x00100000" name="OSSUPL4"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 5" mask="0x00200000" name="OSSUPL5"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 6" mask="0x00400000" name="OSSUPL6"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 7" mask="0x00800000" name="OSSUPL7"/>
        </register>
        <register caption="PWM Output Selection Clear Update Register" name="PWM_OSCUPD" offset="0x58" rw="W" size="4">
          <bitfield caption="Output Selection Clear for PWMH output of the channel 0" mask="0x00000001" name="OSCUPH0"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 1" mask="0x00000002" name="OSCUPH1"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 2" mask="0x00000004" name="OSCUPH2"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 3" mask="0x00000008" name="OSCUPH3"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 4" mask="0x00000010" name="OSCUPH4"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 5" mask="0x00000020" name="OSCUPH5"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 6" mask="0x00000040" name="OSCUPH6"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 7" mask="0x00000080" name="OSCUPH7"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 0" mask="0x00010000" name="OSCUPL0"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 1" mask="0x00020000" name="OSCUPL1"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 2" mask="0x00040000" name="OSCUPL2"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 3" mask="0x00080000" name="OSCUPL3"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 4" mask="0x00100000" name="OSCUPL4"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 5" mask="0x00200000" name="OSCUPL5"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 6" mask="0x00400000" name="OSCUPL6"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 7" mask="0x00800000" name="OSCUPL7"/>
        </register>
        <register caption="PWM Fault Mode Register" name="PWM_FMR" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Fault Polarity (fault input bit varies from 0 to 5)" mask="0x000000FF" name="FPOL"/>
          <bitfield caption="Fault Activation Mode (fault input bit varies from 0 to 5)" mask="0x0000FF00" name="FMOD"/>
          <bitfield caption="Fault Filtering (fault input bit varies from 0 to 5)" mask="0x00FF0000" name="FFIL"/>
        </register>
