turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8H.atdf
      <value-group caption="" name="RTC_SR__SEC">
        <value caption="No second event has occurred since the last clear." name="NO_SECEVENT" value="0"/>
        <value caption="At least one second event has occurred since the last clear." name="SECEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TIMEV">
        <value caption="No time event has occurred since the last clear." name="NO_TIMEVENT" value="0"/>
        <value caption="At least one time event has occurred since the last clear." name="TIMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__CALEV">
        <value caption="No calendar event has occurred since the last clear." name="NO_CALEVENT" value="0"/>
        <value caption="At least one calendar event has occurred since the last clear." name="CALEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x525443"/>
      </value-group>
    </module>
    <module caption="Real-time Timer" name="RTT" version="6081I">
      <register-group name="RTT">
        <register caption="Mode Register" name="RTT_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Real-time Timer Prescaler Value" mask="0x0000FFFF" name="RTPRES"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00010000" name="ALMIEN"/>
          <bitfield caption="Real-time Timer Increment Interrupt Enable" mask="0x00020000" name="RTTINCIEN"/>
          <bitfield caption="Real-time Timer Restart" mask="0x00040000" name="RTTRST"/>
        </register>
        <register caption="Alarm Register" name="RTT_AR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Alarm Value" mask="0xFFFFFFFF" name="ALMV"/>
        </register>
        <register caption="Value Register" name="RTT_VR" offset="0x08" rw="R" size="4">
          <bitfield caption="Current Real-time Value" mask="0xFFFFFFFF" name="CRTV"/>
        </register>
        <register caption="Status Register" name="RTT_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Real-time Alarm Status" mask="0x00000001" name="ALMS"/>
          <bitfield caption="Real-time Timer Increment" mask="0x00000002" name="RTTINC"/>
        </register>
      </register-group>
    </module>
    <module caption="SDRAM Controller" name="SDRAMC" version="6100N">
      <register-group name="SDRAMC">
        <register caption="SDRAMC Mode Register" name="SDRAMC_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="SDRAMC Command Mode" mask="0x00000007" name="MODE" values="SDRAMC_MR__MODE"/>
        </register>
        <register caption="SDRAMC Refresh Timer Register" name="SDRAMC_TR" offset="0x04" rw="RW" size="4">
          <bitfield caption="SDRAMC Refresh Timer Count" mask="0x00000FFF" name="COUNT"/>
        </register>
        <register caption="SDRAMC Configuration Register" name="SDRAMC_CR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Number of Column Bits" mask="0x00000003" name="NC" values="SDRAMC_CR__NC"/>
          <bitfield caption="Number of Row Bits" mask="0x0000000C" name="NR" values="SDRAMC_CR__NR"/>
          <bitfield caption="Number of Banks" mask="0x00000010" name="NB" values="SDRAMC_CR__NB"/>
          <bitfield caption="CAS Latency" mask="0x00000060" name="CAS" values="SDRAMC_CR__CAS"/>
          <bitfield caption="Data Bus Width" mask="0x00000080" name="DBW"/>
          <bitfield caption="Write Recovery Delay" mask="0x00000F00" name="TWR"/>
          <bitfield caption="Row Cycle Delay and Row Refresh Cycle" mask="0x0000F000" name="TRC_TRFC"/>
          <bitfield caption="Row Precharge Delay" mask="0x000F0000" name="TRP"/>
          <bitfield caption="Row to Column Delay" mask="0x00F00000" name="TRCD"/>
          <bitfield caption="Active to Precharge Delay" mask="0x0F000000" name="TRAS"/>
          <bitfield caption="Exit Self Refresh to Active Delay" mask="0xF0000000" name="TXSR"/>
        </register>
        <register caption="SDRAMC Low Power Register" name="SDRAMC_LPR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Low-power Configuration Bits" mask="0x00000003" name="LPCB" values="SDRAMC_LPR__LPCB"/>
          <bitfield caption="Partial Array Self-refresh (only for low-power SDRAM)" mask="0x00000070" name="PASR"/>
          <bitfield caption="Temperature Compensated Self-Refresh (only for low-power SDRAM)" mask="0x00000300" name="TCSR"/>
          <bitfield caption="Drive Strength (only for low-power SDRAM)" mask="0x00000C00" name="DS"/>
          <bitfield caption="Time to define when low-power mode is enable" mask="0x00003000" name="TIMEOUT" values="SDRAMC_LPR__TIMEOUT"/>
        </register>
        <register caption="SDRAMC Interrupt Enable Register" name="SDRAMC_IER" offset="0x14" rw="W" size="4">
          <bitfield caption="Refresh Error Status" mask="0x00000001" name="RES"/>
        </register>
        <register caption="SDRAMC Interrupt Disable Register" name="SDRAMC_IDR" offset="0x18" rw="W" size="4">
          <bitfield caption="Refresh Error Status" mask="0x00000001" name="RES"/>
        </register>
        <register caption="SDRAMC Interrupt Mask Register" name="SDRAMC_IMR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Refresh Error Status" mask="0x00000001" name="RES"/>
        </register>
        <register caption="SDRAMC Interrupt Status Register" name="SDRAMC_ISR" offset="0x20" rw="R" size="4">
          <bitfield caption="Refresh Error Status" mask="0x00000001" name="RES"/>
        </register>
        <register caption="SDRAMC Memory Device Register" name="SDRAMC_MDR" offset="0x24" rw="RW" size="4">
          <bitfield caption="Memory Device Type" mask="0x00000003" name="MD" values="SDRAMC_MDR__MD"/>
        </register>
        <register caption="SDRAMC Configuration Register 1" name="SDRAMC_CR1" offset="0x28" rw="RW" size="4">
          <bitfield caption="Number of Column Bits" mask="0x00000003" name="NC" values="SDRAMC_CR1__NC"/>
          <bitfield caption="Number of Row Bits" mask="0x0000000C" name="NR" values="SDRAMC_CR1__NR"/>
          <bitfield caption="Number of Banks" mask="0x00000010" name="NB" values="SDRAMC_CR1__NB"/>
          <bitfield caption="CAS Latency" mask="0x00000060" name="CAS" values="SDRAMC_CR1__CAS"/>
          <bitfield caption="Data Bus Width" mask="0x00000080" name="DBW"/>
          <bitfield caption="Write Recovery Delay" mask="0x00000F00" name="TWR"/>
          <bitfield caption="Row Cycle Delay and Row Refresh Cycle" mask="0x0000F000" name="TRC_TRFC"/>
          <bitfield caption="Row Precharge Delay" mask="0x000F0000" name="TRP"/>
          <bitfield caption="Row to Column Delay" mask="0x00F00000" name="TRCD"/>
          <bitfield caption="Active to Precharge Delay" mask="0x0F000000" name="TRAS"/>
          <bitfield caption="Exit Self Refresh to Active Delay" mask="0xF0000000" name="TXSR"/>
        </register>
        <register caption="SDRAMC OCMS Register 1" name="SDRAMC_OCMS" offset="0x2C" rw="RW" size="4">
          <bitfield caption="SDRAM Memory Controller Scrambling Enable" mask="0x00000001" name="SDR_SE"/>
        </register>
      </register-group>
      <value-group caption="" name="SDRAMC_MR__MODE">
        <value caption="Normal mode. Any access to the SDRAM is decoded normally. To activate this mode, command must be followed by a write to the SDRAM." name="NORMAL" value="0x0"/>
        <value caption="The SDRAM Controller issues a NOP command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM." name="NOP" value="0x1"/>
        <value caption="The SDRAM Controller issues an &#34;All Banks Precharge&#34; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM." name="ALLBANKS_PRECHARGE" value="0x2"/>
        <value caption="The SDRAM Controller issues a &#34;Load Mode Register&#34; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM." name="LOAD_MODEREG" value="0x3"/>
        <value caption="The SDRAM Controller issues an &#34;Auto-Refresh&#34; Command when the SDRAM device is accessed regardless of the cycle. Previously, an &#34;All Banks Precharge&#34; command must be issued. To activate this mode, command must be followed by a write to the SDRAM." name="AUTO_REFRESH" value="0x4"/>
        <value caption="The SDRAM Controller issues an &#34;Extended Load Mode Register&#34; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the &#34;Extended Load Mode Register&#34; command must be followed by a write to the SDRAM. The write in the SDRAM must be done in the appropriate bank; most low-power SDRAM devices use the bank 1." name="EXT_LOAD_MODEREG" value="0x5"/>
        <value caption="Deep power-down mode. Enters deep power-down mode." name="DEEP_POWERDOWN" value="0x6"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR__NC">
        <value caption="8 column bits" name="COL8" value="0x0"/>
        <value caption="9 column bits" name="COL9" value="0x1"/>
        <value caption="10 column bits" name="COL10" value="0x2"/>
        <value caption="11 column bits" name="COL11" value="0x3"/>
      </value-group>
