turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8H.atdf
      <value-group caption="" name="SMC_MODE5__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE5__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE6__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE6__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE6__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE6__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE7__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE7__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE7__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE7__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_WPCR__WP_KEY">
        <value caption="Writing any other value in this field aborts the write operation of the WP_EN bit. Always reads as 0." name="PASSWD" value="0x534D43"/>
      </value-group>
    </module>
    <module caption="Serial Peripheral Interface" name="SPI" version="6088W">
      <register-group name="SPI">
        <register caption="Control Register" name="SPI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="SPI Enable" mask="0x00000001" name="SPIEN"/>
          <bitfield caption="SPI Disable" mask="0x00000002" name="SPIDIS"/>
          <bitfield caption="SPI Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
        </register>
        <register caption="Mode Register" name="SPI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Master/Slave Mode" mask="0x00000001" name="MSTR"/>
          <bitfield caption="Peripheral Select" mask="0x00000002" name="PS"/>
          <bitfield caption="Chip Select Decode" mask="0x00000004" name="PCSDEC"/>
          <bitfield caption="Mode Fault Detection" mask="0x00000010" name="MODFDIS"/>
          <bitfield caption="Wait Data Read Before Transfer" mask="0x00000020" name="WDRBT"/>
          <bitfield caption="Local Loopback Enable" mask="0x00000080" name="LLB"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
          <bitfield caption="Delay Between Chip Selects" mask="0xFF000000" name="DLYBCS"/>
        </register>
        <register caption="Receive Data Register" name="SPI_RDR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
        </register>
        <register caption="Transmit Data Register" name="SPI_TDR" offset="0x0C" rw="W" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
        </register>
        <register caption="Status Register" name="SPI_SR" offset="0x10" rw="R" size="4">
          <bitfield caption="Receive Data Register Full" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Status" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Status (Slave Mode Only)" mask="0x00000400" name="UNDES"/>
          <bitfield caption="SPI Enable Status" mask="0x00010000" name="SPIENS"/>
        </register>
        <register caption="Interrupt Enable Register" name="SPI_IER" offset="0x14" rw="W" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Enable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Enable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Enable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Enable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000400" name="UNDES"/>
        </register>
        <register caption="Interrupt Disable Register" name="SPI_IDR" offset="0x18" rw="W" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Disable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Disable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Disable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Disable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000400" name="UNDES"/>
        </register>
        <register caption="Interrupt Mask Register" name="SPI_IMR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Mask" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Mask" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Mask" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Mask" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Mask" mask="0x00000400" name="UNDES"/>
        </register>
