turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8H.atdf
        <register caption="Host Pipe Disable Register (n = 0) 9" name="UOTGHS_HSTPIPIDR9" offset="0x644" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 0" name="UOTGHS_HSTPIPINRQ0" offset="0x650" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 1" name="UOTGHS_HSTPIPINRQ1" offset="0x654" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 2" name="UOTGHS_HSTPIPINRQ2" offset="0x658" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 3" name="UOTGHS_HSTPIPINRQ3" offset="0x65C" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 4" name="UOTGHS_HSTPIPINRQ4" offset="0x660" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 5" name="UOTGHS_HSTPIPINRQ5" offset="0x664" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 6" name="UOTGHS_HSTPIPINRQ6" offset="0x668" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 7" name="UOTGHS_HSTPIPINRQ7" offset="0x66C" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 8" name="UOTGHS_HSTPIPINRQ8" offset="0x670" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 9" name="UOTGHS_HSTPIPINRQ9" offset="0x674" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe Error Register (n = 0) 0" name="UOTGHS_HSTPIPERR0" offset="0x680" rw="RW" size="4">
          <bitfield caption="Data Toggle Error" mask="0x00000001" name="DATATGL"/>
          <bitfield caption="Data PID Error" mask="0x00000002" name="DATAPID"/>
          <bitfield caption="PID Error" mask="0x00000004" name="PID"/>
          <bitfield caption="Time-Out Error" mask="0x00000008" name="TIMEOUT"/>
          <bitfield caption="CRC16 Error" mask="0x00000010" name="CRC16"/>
          <bitfield caption="Error Counter" mask="0x00000060" name="COUNTER"/>
        </register>
        <register caption="Host Pipe Error Register (n = 0) 1" name="UOTGHS_HSTPIPERR1" offset="0x684" rw="RW" size="4">
          <bitfield caption="Data Toggle Error" mask="0x00000001" name="DATATGL"/>
          <bitfield caption="Data PID Error" mask="0x00000002" name="DATAPID"/>
          <bitfield caption="PID Error" mask="0x00000004" name="PID"/>
          <bitfield caption="Time-Out Error" mask="0x00000008" name="TIMEOUT"/>
          <bitfield caption="CRC16 Error" mask="0x00000010" name="CRC16"/>
          <bitfield caption="Error Counter" mask="0x00000060" name="COUNTER"/>
        </register>
        <register caption="Host Pipe Error Register (n = 0) 2" name="UOTGHS_HSTPIPERR2" offset="0x688" rw="RW" size="4">
          <bitfield caption="Data Toggle Error" mask="0x00000001" name="DATATGL"/>
          <bitfield caption="Data PID Error" mask="0x00000002" name="DATAPID"/>
          <bitfield caption="PID Error" mask="0x00000004" name="PID"/>
          <bitfield caption="Time-Out Error" mask="0x00000008" name="TIMEOUT"/>
          <bitfield caption="CRC16 Error" mask="0x00000010" name="CRC16"/>
          <bitfield caption="Error Counter" mask="0x00000060" name="COUNTER"/>
        </register>
